// src/components/WhatsAppButton.tsx
import Link from 'next/link';
import styles from './WhatsAppButton.module.css';

export default function WhatsAppButton() {
    const phoneNumber = '966593008572'; // <--  استبدل هذا الرقم برقمك مع مفتاح الدولة وبدون + أو 00

    return (
        <Link 
            href={`https://wa.me/${phoneNumber}`} 
            target="_blank" 
            rel="noopener noreferrer"
            className={styles.whatsappButton}
            aria-label="تواصل معنا عبر واتساب"
        >
            <svg xmlns="http://www.w3.org/2000/svg" className={styles.whatsappIcon} viewBox="0 0 24 24" fill="currentColor">
                <path d="M.057 24l1.687-6.163c-1.041-1.804-1.588-3.849-1.587-5.946.003-6.556 5.338-11.891 11.893-11.891 3.181.001 6.167 1.24 8.413 3.488 2.245 2.248 3.487 5.235 3.487 8.413 0 6.557-5.338 11.892-11.894 11.892-1.99 0-3.903-.52-5.687-1.475L.057 24zm6.597-3.807c1.676.995 3.276 1.591 5.392 1.592 5.448 0 9.886-4.434 9.889-9.885.002-5.447-4.433-9.886-9.888-9.886-5.448 0-9.886 4.434-9.889 9.885-.002 2.024.56 3.98 1.592 5.686l-1.025 3.748 3.86-1.024zM9.072 8.411c.312-.158.487-.123.629-.123.165 0 .327.015.465.252.195.341.623 1.514.675 1.63.052.117.087.195.004.312-.083.117-.243.277-.487.52-.244.244-.488.292-.703.488-.214.195-.443.43-.628.59-.186.16-.372.16-.547.015-.175-.145-.747-.264-1.42-1.42z" />
            </svg>
        </Link>
    );
}